# todo: Определить в коде переменные:
# 1. Целочисленного типа
a=int(input('Введите целое число: '))
print(a)
# 2. Вещественного типа
b=float(input('Введите вещественное число: '))
print(b)
# 3. Логического типа
c=bool(input('Введите логическое значение: '))
print(c)
# 4. Строкового типа
d=str(input('Введите строку: '))
print(d)
# 5. Пустого типа
e=input('Введите что-то: ')
# Вывести их типы.
print(f"Тип переменной a: {type(a)}")
print(f"Тип переменной b: {type(b)}")
print(f"Тип переменной c: {type(c)}")
print(f"Тип переменной d: {type(d)}")
print(f"Тип переменной e: {type(e)}")

